AthenasArch/ESP32S3-CAN-OBD2-Firmware/src/taskManager/Tasks/canTask.cpp
/**
 * CAN OBD2 Monitor com detecção automática de protocolo
 * - Zera PIDs ao perder conexão
 * - Redetecção robusta (mutex + cooldown) sem double-init do TWAI
 * - Evita crashes por begin()/end() concorrentes.
 * 
 * 		ISO15765-4 11 bit 500 k
 * 		ISO15765-4 11 bit 250 k 
 * 		ISO15765-4 29 bit 500 k
 * 		ISO15765-4 29 bit 250 k
 * 		ISO9141-2
 * 		ISO14230-4 KWP2000 5BPS
 * 		ISO14230-4 KWP2000 FAST
 * 
 */
/**
 * CAN OBD2 Monitor com detecção automática dos 4 modos CAN ISO15765-4:
 *  - 11b/500k  (usa esp32_obd2)
 *  - 11b/250k  (usa esp32_obd2)
 *  - 29b/500k  (usa esp32_can direto - manual)
 *  - 29b/250k  (usa esp32_can direto - manual)
 *
 * Observações:
 * - Protocolos K-Line (ISO9141-2 e ISO14230/KWP2000) NÃO são suportados por hardware CAN/TWAI.
 * - Para 29-bit a esp32_obd2 não cobre o fluxo (endereçamento estendido); por isso, usamos esp32_can.
 * - Evita double-init do TWAI: quando vamos usar OBD2, paramos o CAN "manual" e vice-versa.
 */

// #include <Arduino.h>
// #include <esp32_obd2.h> // Alto nível (11-bit)
// #include <esp32_can.h>  // CAN (TWAI) baixo nível p/ 29-bit
// #include <can_common.h>
// #include "Hardware/hardware.h"
// #include "taskManager/Tasks/canTask.hpp"
// #include "taskManager/taskManager.h"
// #include "freertos/semphr.h"

// // =====================
// // DEBUG
// // =====================
// #define CAN_TASK_DEBUG_ENABLE
// #ifdef CAN_TASK_DEBUG_ENABLE
//     #define CAN_TASK_DEBUG_PRINT(...)   { Serial.print(__VA_ARGS__); }
//     #define CAN_TASK_DEBUG_PRINTLN(...) { Serial.println(__VA_ARGS__); }
//     #define CAN_TASK_DEBUG_PRINTF(...)  { Serial.printf(__VA_ARGS__); }
// #else
//     #define CAN_TASK_DEBUG_PRINT(...)
//     #define CAN_TASK_DEBUG_PRINTLN(...)
//     #define CAN_TASK_DEBUG_PRINTF(...)
// #endif

// // =====================
// // Controle de tempo
// // =====================
// static uint32_t lastFast = 0;
// static uint32_t lastMedium = 0;
// static uint32_t lastSlow = 0;
// static uint32_t lastLog = 0;

// // =====================
// // Estado global
// // =====================
// enum CanAddrMode
// {
//     ADDR_11BIT = 0,
//     ADDR_29BIT = 1
// };

// static bool g_connected = false;
// static bool g_detectInProgress = false;
// static uint32_t g_lastDetectMs = 0;
// static uint32_t g_detectBackoffMs = 1000; // 1s -> 2s -> 4s -> 8s (máx)
// static uint8_t g_failCount = 0;

// static uint32_t g_currBaud = 0;
// static CanAddrMode g_currAddrMode = ADDR_11BIT;

// // Mutex para serializar begin()/end()
// static SemaphoreHandle_t g_canStackMutex = nullptr;

// // =====================
// // Reset PIDs
// // =====================
// static void canMonitor_reset(SystemStatus *s)
// {
//     s->automotiveSystem.canMonitor.engineRPM = 0;
//     s->automotiveSystem.canMonitor.vehicleSpeed = 0;
//     s->automotiveSystem.canMonitor.fuelLevel = 0;
//     s->automotiveSystem.canMonitor.engineCoolantTemperature = 0;
//     s->automotiveSystem.canMonitor.intakeAirTemperature = 0;
//     s->automotiveSystem.canMonitor.intakeManifoldPressure = 0;
//     s->automotiveSystem.canMonitor.throttlePosition = 0;
//     s->automotiveSystem.canMonitor.ignitionTimingAdvance = 0;
//     s->automotiveSystem.canMonitor.calculatedLoadValue = 0;
//     s->automotiveSystem.canMonitor.massAirFlowRate = 0;
// }

// // =====================
// // Util | fecha tudo
// // =====================
// static void close_all_stacks()
// {
//     // Fecha OBD2 (se estiver rodando)
//     OBD2.end();
//     // Fecha driver CAN que a esp32_can abriu
//     CAN0.disable();
// }

// // =====================
// // OBD2 (11-bit) stack restart
// // =====================
// static bool start_obd2_11bit(uint32_t baud)
// {
//     if (!g_canStackMutex){
//         g_canStackMutex = xSemaphoreCreateMutex();
//     }
//     xSemaphoreTake(g_canStackMutex, portMAX_DELAY);

//     close_all_stacks();
//     vTaskDelay(pdMS_TO_TICKS(100));

//     CAN0.setCANPins((gpio_num_t)PIN_PCI_ATHENAS_CAN_RX,
//                     (gpio_num_t)PIN_PCI_ATHENAS_CAN_TX);

//     // Inicia OBD2 primeiro (sempre em 500k internamente)
//     OBD2.begin();
//     OBD2.setTimeout(TIME_TO_REQUEST_CAN_PID);

//     // Força baud correto em seguida
//     CAN0.set_baudrate(baud);

//     g_currAddrMode = ADDR_11BIT;
//     xSemaphoreGive(g_canStackMutex);
//     return true;
// }

// // =====================
// // CAN manual (29-bit) stack restart
// // =====================
// static bool start_can_29bit(uint32_t baud)
// {
//     if (!g_canStackMutex){
//         g_canStackMutex = xSemaphoreCreateMutex();
//     }
        
//     xSemaphoreTake(g_canStackMutex, portMAX_DELAY);

//     close_all_stacks();
//     vTaskDelay(pdMS_TO_TICKS(200)); // cooldown

//     // Driver CAN direto (esp32_can cuida de instalar TWAI)
//     CAN0.setCANPins((gpio_num_t)PIN_PCI_ATHENAS_CAN_RX, (gpio_num_t)PIN_PCI_ATHENAS_CAN_TX);
//     CAN0.set_baudrate(baud);

//     xSemaphoreGive(g_canStackMutex);
//     return true;
// }

// // =====================
// // SAFE PID via OBD2 (11-bit)
// // =====================
// static inline bool safePid11(float &out, uint8_t pid)
// {
//     float v = OBD2.pidRead(pid);
//     if (isnan(v))
//         return false;
//     out = v;
//     return true;
// }

// // =====================
// // Envio/Recebimento OBD-II 29-bit (manual)
// // - Request funcional 29-bit: 0x18DB33F1
// // - Respostas típicas: 0x18DAF1xx (qualquer ECU xx)
// // - ISO-TP Single Frame: data[0] = 0x02 (len=2), data[1]=serviço (0x01), data[2]=PID
// // =====================
// static bool send_pid_29(uint8_t service, uint8_t pid)
// {
//     CAN_FRAME tx;
//     tx.id = 0x18DB33F1; // Functional request 29-bit
//     tx.extended = true;
//     tx.rtr = 0;
//     tx.length = 8;
//     tx.data.byte[0] = 0x02;    // 2 bytes de payload (01, PID)
//     tx.data.byte[1] = service; // 0x01 = Current Data
//     tx.data.byte[2] = pid;
//     tx.data.byte[3] = 0x00;
//     tx.data.byte[4] = 0x00;
//     tx.data.byte[5] = 0x00;
//     tx.data.byte[6] = 0x00;
//     tx.data.byte[7] = 0x00;

//     return CAN0.sendFrame(tx);
// }

// static bool recv_pid_29(uint8_t expected_service_resp, uint8_t pid, uint8_t *outData, uint32_t timeout_ms)
// {
//     uint32_t start = millis();
//     while ((millis() - start) < timeout_ms)
//     {
//         if (CAN0.rx_avail())
//         {
//             CAN_FRAME rx;
//             if (CAN0.get_rx_buff(rx))
//             {
//                 if (!rx.extended)
//                     continue; // precisamos de 29-bit

//                 // Verificação básica do payload ISO-TP SF e do serviço/PIB
//                 // Para resposta, data[0] = 0x.. (len), data[1] = service|0x40, data[2] = pid ecoado
//                 if (rx.length >= 3)
//                 {
//                     uint8_t pci_len = rx.data.byte[0] & 0x0F; // nibble de len
//                     uint8_t svc = rx.data.byte[1];
//                     uint8_t pid_rx = rx.data.byte[2];

//                     if (svc == expected_service_resp && pid_rx == pid && pci_len >= 2)
//                     {
//                         // Copia o restante
//                         for (int i = 0; i < rx.length; i++)
//                             outData[i] = rx.data.byte[i];
//                         return true;
//                     }
//                 }
//             }
//         }
//         vTaskDelay(pdMS_TO_TICKS(2));
//     }
//     return false;
// }

// // Decodificador básico de alguns PIDs (para 29-bit manual)
// // NOTA: mesma matemática do OBD2
// static bool pidRead29(uint8_t pid, float &outVal)
// {
//     const uint8_t SERVICE = 0x01;
//     const uint8_t SERVICE_RESP = 0x41;

