AthenasArch/ESP32S3-CAN-OBD2-Firmware/src/taskManager/Tasks/canTask.cpp
//     if (!send_pid_29(SERVICE, pid))
//         return false;

//     uint8_t buf[8] = {0};
//     if (!recv_pid_29(SERVICE_RESP, pid, buf, 200))
//         return false;

//     // buf[0] = PCI (len), buf[1] = 0x41, buf[2] = pid
//     uint8_t A = buf[3];
//     uint8_t B = (buf[4]);
//     // uint8_t C = buf[5];
//     // uint8_t D = buf[6];

//     switch (pid)
//     {
//     case ENGINE_RPM:
//     { // 0x0C: RPM = (256*A + B)/4
//         outVal = (256.0f * A + B) / 4.0f;
//         return true;
//     }
//     case VEHICLE_SPEED:
//     { // 0x0D: km/h
//         outVal = A;
//         return true;
//     }
//     case ENGINE_COOLANT_TEMPERATURE: // 0x05: °C = A - 40
//     case AIR_INTAKE_TEMPERATURE:
//     { // 0x0F: °C = A - 40
//         outVal = (int)A - 40;
//         return true;
//     }
//     case INTAKE_MANIFOLD_ABSOLUTE_PRESSURE:
//     { // 0x0B: kPa = A
//         outVal = A;
//         return true;
//     }
//     case THROTTLE_POSITION: // 0x11: % = A * 100 / 255
//     case CALCULATED_ENGINE_LOAD:
//     { // 0x04: % = A * 100 / 255
//         outVal = (A * 100.0f) / 255.0f;
//         return true;
//     }
//     case MAF_AIR_FLOW_RATE:
//     { // 0x10: g/s = (256*A + B)/100
//         outVal = (256.0f * A + B) / 100.0f;
//         return true;
//     }
//     case TIMING_ADVANCE:
//     { // 0x0E: ° = (A/2) - 64
//         outVal = (A / 2.0f) - 64.0f;
//         return true;
//     }
//     case FUEL_TANK_LEVEL_INPUT:
//     { // 0x2F: % = A * 100 / 255
//         outVal = (A * 100.0f) / 255.0f;
//         return true;
//     }
//     case PIDS_SUPPORT_01_20:
//     { // 0x00: apenas checagem (qualquer retorno serve)
//         outVal = 1.0f;
//         return true;
//     }
//     }
//     return false; // PID não mapeado aqui
// }

// // Wrapper de leitura que escolhe 11b/29b automaticamente
// static inline bool safePid(float &out, uint8_t pid)
// {
//     if (g_currAddrMode == ADDR_11BIT)
//     {
//         return safePid11(out, pid);
//     }
//     else
//     {
//         return pidRead29(pid, out);
//     }
// }

// // =====================
// // Coletas
// // =====================
// static void canMonitor_collectFastPIDs(SystemStatus *systemStatus)
// {
//     float v;
//     if (safePid(v, ENGINE_RPM))
//         systemStatus->automotiveSystem.canMonitor.engineRPM = (int)v;
//     if (safePid(v, VEHICLE_SPEED))
//         systemStatus->automotiveSystem.canMonitor.vehicleSpeed = (int)v;
// }

// static void canMonitor_collectMediumPIDs(SystemStatus *systemStatus)
// {
//     float v;
//     if (safePid(v, FUEL_TANK_LEVEL_INPUT))
//         systemStatus->automotiveSystem.canMonitor.fuelLevel = (int)v;
//     if (safePid(v, ENGINE_COOLANT_TEMPERATURE))
//         systemStatus->automotiveSystem.canMonitor.engineCoolantTemperature = (int)v;
//     if (safePid(v, AIR_INTAKE_TEMPERATURE))
//         systemStatus->automotiveSystem.canMonitor.intakeAirTemperature = (int)v;
//     if (safePid(v, INTAKE_MANIFOLD_ABSOLUTE_PRESSURE))
//         systemStatus->automotiveSystem.canMonitor.intakeManifoldPressure = (int)v;
// }

// static void canMonitor_collectSlowPIDs(SystemStatus *systemStatus)
// {
//     float v;
//     if (safePid(v, THROTTLE_POSITION))
//         systemStatus->automotiveSystem.canMonitor.throttlePosition = (int)v;
//     if (safePid(v, TIMING_ADVANCE))
//         systemStatus->automotiveSystem.canMonitor.ignitionTimingAdvance = (int)v;
//     if (safePid(v, CALCULATED_ENGINE_LOAD))
//         systemStatus->automotiveSystem.canMonitor.calculatedLoadValue = v;
//     if (safePid(v, MAF_AIR_FLOW_RATE))
//         systemStatus->automotiveSystem.canMonitor.massAirFlowRate = v;
// }

// // =====================
// // Debug
// // =====================
// static void canMonitor_debug(SystemStatus *systemStatus)
// {
//     CAN_TASK_DEBUG_PRINTLN("====== OBD MONITOR ======");
//     CAN_TASK_DEBUG_PRINTF("RPM: %ld\n", systemStatus->automotiveSystem.canMonitor.engineRPM);
//     CAN_TASK_DEBUG_PRINTF("Velocidade: %d km/h\n", systemStatus->automotiveSystem.canMonitor.vehicleSpeed);
//     CAN_TASK_DEBUG_PRINTF("Combustível: %d\n", systemStatus->automotiveSystem.canMonitor.fuelLevel);
//     CAN_TASK_DEBUG_PRINTF("Temp. Motor: %d °C\n", systemStatus->automotiveSystem.canMonitor.engineCoolantTemperature);
//     CAN_TASK_DEBUG_PRINTF("Temp. Ar: %d °C\n", systemStatus->automotiveSystem.canMonitor.intakeAirTemperature);
//     CAN_TASK_DEBUG_PRINTF("Pressão Coletor: %d kPa\n", systemStatus->automotiveSystem.canMonitor.intakeManifoldPressure);
//     CAN_TASK_DEBUG_PRINTF("Posição Acelerador: %d %%\n", systemStatus->automotiveSystem.canMonitor.throttlePosition);
//     CAN_TASK_DEBUG_PRINTF("Avanço Ignição: %d °\n", systemStatus->automotiveSystem.canMonitor.ignitionTimingAdvance);
//     CAN_TASK_DEBUG_PRINTF("Carga Calculada: %.2f\n", systemStatus->automotiveSystem.canMonitor.calculatedLoadValue);
//     CAN_TASK_DEBUG_PRINTF("MAF: %.2f g/s\n", systemStatus->automotiveSystem.canMonitor.massAirFlowRate);
//     CAN_TASK_DEBUG_PRINTLN("==========================");
// }

// // =====================
// // Detecção de protocolo CAN OBD-II
// // Testa em ordem:
// //   11b/500k → 11b/250k → 29b/500k → 29b/250k
// //
// // Critério de sucesso:
// //   - conseguir ler PIDS_SUPPORT_01_20 (PID 0x00) OU ENGINE_RPM (PID 0x0C)
// //   - e confirmar com uma segunda leitura válida de RPM
// //
// // Proteções adicionadas:
// //   - cooldown entre tentativas (g_detectBackoffMs)
// //   - safePid11() com proteção contra ponteiros inválidos (OBD2 sem resposta)
// //   - se não houver ECU, aborta aquele baud ao invés de crashar
// // =====================
// static bool detect_protocol(SystemStatus *sys)
// {
//     if (g_detectInProgress){
//         return false; // já rodando? aborta
//     }
    
//     // Lista de combinações a testar
//     const struct
//     {
//         uint32_t baud;
//         CanAddrMode mode;
//         const char *label;
//     } tries[] = {
//         {CAN_BPS_500K, ADDR_11BIT, "11b/500k"},
//         {CAN_BPS_250K, ADDR_11BIT, "11b/250k"}, // aqui dava crash → agora protegido
//         {CAN_BPS_500K, ADDR_29BIT, "29b/500k"},
//         {CAN_BPS_250K, ADDR_29BIT, "29b/250k"},
//     };

//     // aplica cooldown entre varreduras
//     const uint32_t now = millis();
//     if ((now - g_lastDetectMs) < g_detectBackoffMs){
//         return false;
//     }
        
//     g_detectInProgress = true;
//     bool detected = false;

//     for (auto &t : tries)
//     {
//         CAN_TASK_DEBUG_PRINTF("[CAN]\tTestando %s...\n", t.label);

