AthenasArch/ESP32S3-CAN-OBD2-Firmware/src/taskManager/Tasks/canTask.cpp
//         // inicia stack correspondente (11b usa esp32_obd2, 29b é manual)
//         bool started = (t.mode == ADDR_11BIT) ? start_obd2_11bit(t.baud)
//                                               : start_can_29bit(t.baud);
//         if (!started){
//             continue;
//         }

//         vTaskDelay(pdMS_TO_TICKS(300)); // tempo pro barramento estabilizar

//         bool ok1 = false, ok2 = false;
//         float v;

//         // 1ª checagem: PID 0x00 (supported) ou RPM
//         if (t.mode == ADDR_11BIT)
//         {
//             ok1 = safePid11(v, PIDS_SUPPORT_01_20);
//             if (!ok1)
//                 ok1 = safePid11(v, ENGINE_RPM);
//         }
//         else
//         {
//             ok1 = pidRead29(PIDS_SUPPORT_01_20, v);
//             if (!ok1)
//                 ok1 = pidRead29(ENGINE_RPM, v);
//         }

//         // 2ª checagem: confirma RPM de novo
//         if (ok1)
//         {
//             if (t.mode == ADDR_11BIT)
//                 ok2 = safePid11(v, ENGINE_RPM);
//             else
//                 ok2 = pidRead29(ENGINE_RPM, v);
//         }

//         // Se as duas leituras foram válidas → protocolo confirmado
//         if (ok1 && ok2)
//         {
//             g_currBaud = t.baud;
//             g_currAddrMode = t.mode;

//             sys->automotiveSystem.canBaud = t.baud;
//             sys->automotiveSystem.canExtended = (t.mode == ADDR_29BIT) ? 1 : 0;
//             sys->automotiveSystem.canConnected = 1;

//             g_connected = true;
//             g_failCount = 0;

//             CAN_TASK_DEBUG_PRINTF("[CAN]\tECU detectada @ %s\n", t.label);
//             detected = true;
//             break; // sai do loop
//         }
//     }

//     if (!detected)
//     {
//         // não achou nenhum protocolo → limpa tudo
//         close_all_stacks();
//         g_connected = false;
//         sys->automotiveSystem.canConnected = 0;

//         // aumenta cooldown exponencialmente até 8s
//         g_detectBackoffMs = min<uint32_t>(g_detectBackoffMs << 1, 8000);
//         CAN_TASK_DEBUG_PRINTLN("[CAN]\tNenhum protocolo detectado");
//     }
//     else
//     {
//         // se detectou, reseta cooldown p/ resposta rápida
//         g_detectBackoffMs = 1000;
//     }

//     g_lastDetectMs = millis();
//     g_detectInProgress = false;
//     return detected;
// }

// // =====================
// // Task Principal
// // =====================
// void canTask_run(void *pvParameters)
// {
//     SystemStatus *systemStatus = (SystemStatus *)pvParameters;

//     CAN_TASK_DEBUG_PRINTLN("------------------------");
//     CAN_TASK_DEBUG_PRINTLN("    CAN OBD2 MONITOR TASK");
//     CAN_TASK_DEBUG_PRINTLN("------------------------");

//     delay(TIME_TO_INIT_TASK_CAN);

//     // Estado inicial
//     g_connected = false;
//     g_detectInProgress = false;
//     g_lastDetectMs = 0;
//     g_detectBackoffMs = 1000;
//     systemStatus->automotiveSystem.canConnected = false;
//     systemStatus->automotiveSystem.canBaud = 0;
//     systemStatus->automotiveSystem.canExtended = false; // = 29 bits
    
//     canMonitor_reset(systemStatus);

//     if (!g_canStackMutex){
//         g_canStackMutex = xSemaphoreCreateMutex();
//     }

//     // Primeira detecção
//     detect_protocol(systemStatus);

//     unsigned long canTimer = millis();

//     for (;;)
//     {
//         task_checkUsedMem(TASK_NAME_CAN, &canTimer);

//         if (g_connected && systemStatus->automotiveSystem.canConnected)
//         {
//             uint32_t now = millis();

//             if (now - lastFast >= 30)
//             {
//                 lastFast = now;
//                 canMonitor_collectFastPIDs(systemStatus);
//             }
//             if (now - lastMedium >= 600)
//             {
//                 lastMedium = now;
//                 canMonitor_collectMediumPIDs(systemStatus);
//             }
//             if (now - lastSlow >= 1000)
//             {
//                 lastSlow = now;
//                 canMonitor_collectSlowPIDs(systemStatus);
//             }
//             if (now - lastLog >= 1000)
//             {
//                 lastLog = now;
//                 canMonitor_debug(systemStatus);
//             }

//             // Heartbeat: duas verificações para “não confundir” ruído com perda real
//             float tmp;
//             bool okHeartbeat = safePid(tmp, ENGINE_RPM);
//             if (!okHeartbeat)
//             {
//                 float dummy;
//                 okHeartbeat = safePid(dummy, PIDS_SUPPORT_01_20);
//             }

//             if (!okHeartbeat)
//             {
//                 if (++g_failCount > 5)
//                 {
//                     CAN_TASK_DEBUG_PRINTLN("[CAN]\tConexão perdida, zerando e redetectando...");
//                     g_connected = false;
//                     systemStatus->automotiveSystem.canConnected = 0;
//                     canMonitor_reset(systemStatus);

//                     close_all_stacks();
//                     g_lastDetectMs = millis();
//                     g_detectBackoffMs = 1000;
//                     g_failCount = 0;
//                 }
//             }
//             else
//             {
//                 g_failCount = 0;
//             }
//         }
//         else
//         {
//             // Não conectado: zera e tenta (respeitando cooldown)
//             canMonitor_reset(systemStatus);
//             detect_protocol(systemStatus);
//         }

//         vTaskDelay(pdMS_TO_TICKS(10));
//     }
// }



















#include <Arduino.h>
#include <athenasObd2.h>
#include <esp32_can.h>
#include <can_common.h>
#include "Hardware/hardware.h"
#include "taskManager/Tasks/canTask.hpp"
#include "taskManager/taskManager.h"

// =====================
// DEBUG
// =====================
#define CAN_TASK_DEBUG_ENABLE
#ifdef CAN_TASK_DEBUG_ENABLE
  #define CAN_TASK_DEBUG_PRINT(...)   { Serial.print(__VA_ARGS__); }
  #define CAN_TASK_DEBUG_PRINTLN(...) { Serial.println(__VA_ARGS__); }
  #define CAN_TASK_DEBUG_PRINTF(...)  { Serial.printf(__VA_ARGS__); }
#else
  #define CAN_TASK_DEBUG_PRINT(...)
  #define CAN_TASK_DEBUG_PRINTLN(...)
  #define CAN_TASK_DEBUG_PRINTF(...)
#endif
// =====================
// Controle de tempo de coleta/log
// =====================
// Variáveis que armazenam o "último tempo" (em ms) em que cada grupo de coleta foi executado.
// Isso permite espaçar a frequência de leitura de PIDs e evitar leituras redundantes.
static uint32_t lastFast = 0;   // Leituras rápidas (ex.: RPM, velocidade) ~30 ms
static uint32_t lastMed  = 0;   // Leituras médias (ex.: temp. motor, pressão coletor) ~600 ms
static uint32_t lastSlow = 0;   // Leituras lentas (ex.: carga, MAF) ~1000 ms
static uint32_t lastLog  = 0;   // Debug/log de status ~1000 ms

