AthenasArch/ESP32S3-CAN-OBD2-Firmware/src/taskManager/Tasks/canTask.cpp
// =====================
// Auxiliares
// =====================

// Reseta os valores de todos os PIDs monitorados para 0
// Chamado quando a conexão CAN é perdida ou ainda não estabelecida.
static void resetValuePIDs(SystemStatus *s)
{
    s->automotiveSystem.canMonitor.engineRPM = 0;
    s->automotiveSystem.canMonitor.vehicleSpeed = 0;
    s->automotiveSystem.canMonitor.fuelLevel = 0;
    s->automotiveSystem.canMonitor.engineCoolantTemperature = 0;
    s->automotiveSystem.canMonitor.intakeAirTemperature = 0;
    s->automotiveSystem.canMonitor.intakeManifoldPressure = 0;
    s->automotiveSystem.canMonitor.throttlePosition = 0;
    s->automotiveSystem.canMonitor.ignitionTimingAdvance = 0;
    s->automotiveSystem.canMonitor.calculatedLoadValue = 0;
    s->automotiveSystem.canMonitor.massAirFlowRate = 0;
}

// Wrapper seguro para leitura de PIDs.
// Retorna false se a leitura falhar (timeout, erro de barramento, etc.)
static inline bool readPidSafe(uint8_t pid, float &out)
{
    return OBD2.readPid(pid, out);
}

// =====================
// Coletas
// =====================

// Coleta de PIDs mais críticos, que mudam rápido (ex.: RPM, velocidade).
// Executado a cada ~30 ms.
static void collectFast(SystemStatus *st)
{
    float v;
    if (readPidSafe(ENGINE_RPM, v))
        st->automotiveSystem.canMonitor.engineRPM = (int)v;
    if (readPidSafe(VEHICLE_SPEED, v))
        st->automotiveSystem.canMonitor.vehicleSpeed = (int)v;
}

// Coleta de PIDs de média prioridade, que não mudam tão rápido.
// Executado a cada ~600 ms.
static void collectMedium(SystemStatus *st)
{
    float v;
    if (readPidSafe(FUEL_TANK_LEVEL_INPUT, v))
        st->automotiveSystem.canMonitor.fuelLevel = (int)v;
    if (readPidSafe(ENGINE_COOLANT_TEMPERATURE, v))
        st->automotiveSystem.canMonitor.engineCoolantTemperature = (int)v;
    if (readPidSafe(AIR_INTAKE_TEMPERATURE, v))
        st->automotiveSystem.canMonitor.intakeAirTemperature = (int)v;
    if (readPidSafe(INTAKE_MANIFOLD_ABSOLUTE_PRESSURE, v))
        st->automotiveSystem.canMonitor.intakeManifoldPressure = (int)v;
}

// Coleta de PIDs menos críticos, que mudam devagar (ex.: carga calculada, MAF).
// Executado a cada ~1000 ms.
static void collectSlow(SystemStatus *st)
{
    float v;
    if (readPidSafe(THROTTLE_POSITION, v))
        st->automotiveSystem.canMonitor.throttlePosition = (int)v;
    if (readPidSafe(TIMING_ADVANCE, v))
        st->automotiveSystem.canMonitor.ignitionTimingAdvance = (int)v;
    if (readPidSafe(CALCULATED_ENGINE_LOAD, v))
        st->automotiveSystem.canMonitor.calculatedLoadValue = v;
    if (readPidSafe(MAF_AIR_FLOW_RATE, v))
        st->automotiveSystem.canMonitor.massAirFlowRate = v;
}

// Debug detalhado dos valores coletados e status da conexão.
// Executado periodicamente para monitoramento humano.
static void debugDump(SystemStatus *st)
{
    CAN_TASK_DEBUG_PRINTLN("====== OBD MONITOR ======");
    CAN_TASK_DEBUG_PRINTF("Baud: %lu | Ext: %d | Conn: %d\n",
                          (unsigned long)OBD2.currentBaud(),
                          OBD2.isExtended() ? 1 : 0,
                          OBD2.connected() ? 1 : 0);

    CAN_TASK_DEBUG_PRINTF("RPM: %ld\n", st->automotiveSystem.canMonitor.engineRPM);
    CAN_TASK_DEBUG_PRINTF("Velocidade: %d km/h\n", st->automotiveSystem.canMonitor.vehicleSpeed);
    CAN_TASK_DEBUG_PRINTF("Combustível: %d\n", st->automotiveSystem.canMonitor.fuelLevel);
    CAN_TASK_DEBUG_PRINTF("Temp. Motor: %d °C\n", st->automotiveSystem.canMonitor.engineCoolantTemperature);
    CAN_TASK_DEBUG_PRINTF("Temp. Ar: %d °C\n", st->automotiveSystem.canMonitor.intakeAirTemperature);
    CAN_TASK_DEBUG_PRINTF("Pressão Coletor: %d kPa\n", st->automotiveSystem.canMonitor.intakeManifoldPressure);
    CAN_TASK_DEBUG_PRINTF("Posição Acelerador: %d %%\n", st->automotiveSystem.canMonitor.throttlePosition);
    CAN_TASK_DEBUG_PRINTF("Avanço Ignição: %d °\n", st->automotiveSystem.canMonitor.ignitionTimingAdvance);
    CAN_TASK_DEBUG_PRINTF("Carga Calculada: %.2f\n", st->automotiveSystem.canMonitor.calculatedLoadValue);
    CAN_TASK_DEBUG_PRINTF("MAF: %.2f g/s\n", st->automotiveSystem.canMonitor.massAirFlowRate);
    CAN_TASK_DEBUG_PRINTLN("==========================");
}

// =====================
// Task principal (executa como FreeRTOS task)
// =====================
void canTask_run(void *pvParameters)
{
    SystemStatus *systemStatus = (SystemStatus *)pvParameters;

    CAN_TASK_DEBUG_PRINTLN("------------------------");
    CAN_TASK_DEBUG_PRINTLN("    CAN OBD2 MONITOR TASK");
    CAN_TASK_DEBUG_PRINTLN("------------------------");

    vTaskDelay(pdMS_TO_TICKS(TIME_TO_INIT_TASK_CAN)); // Pequeno atraso inicial antes de iniciar a task

    // Configura os pinos físicos do controlador CAN (TWAI no ESP32).
    CAN0.setCANPins((gpio_num_t)PIN_PCI_ATHENAS_CAN_RX,
                    (gpio_num_t)PIN_PCI_ATHENAS_CAN_TX);

    // Configuração da biblioteca OBD2 (FSM interna de heartbeat e reconexão).
    OBD2.setTimeout(TIME_TO_REQUEST_CAN_PID); // Timeout de resposta de PID
    OBD2.setHeartbeatPid(ENGINE_RPM);         // PID usado como "batimento cardíaco"
    OBD2.setHeartbeatInterval(1000);          // Intervalo de 1s entre heartbeats
    OBD2.setBackoff(1000, 8000);              // Backoff exponencial entre tentativas: 1s..8s
    OBD2.setReconnectInterval(10000);         // Intervalo fixo entre tentativas automáticas (10s)

    // Primeira tentativa automática de detecção de protocolo
    OBD2.beginAuto();

    // Atualiza status inicial do sistema
    systemStatus->automotiveSystem.canConnected = OBD2.connected();
    systemStatus->automotiveSystem.canBaud = OBD2.currentBaud();
    systemStatus->automotiveSystem.canExtended = OBD2.isExtended() ? 1 : 0;
    resetValuePIDs(systemStatus); // Começa com os PIDs zerados

    unsigned long canTimer = millis(); // Timer de referência para checagens de memória

    for (;;)
    {
        // Verifica uso de memória dessa task (diagnóstico)
        task_checkUsedMem(TASK_NAME_CAN, &canTimer);

        // Deixa a biblioteca gerenciar heartbeat e reconexão automática
        OBD2.tick();

        // Reflete o status atual da conexão no SystemStatus (visível para o resto do app)
        systemStatus->automotiveSystem.canConnected = OBD2.connected();
        systemStatus->automotiveSystem.canBaud = OBD2.currentBaud();
        systemStatus->automotiveSystem.canExtended = OBD2.isExtended() ? 1 : 0;

        if (systemStatus->automotiveSystem.canConnected)
        {
            // Se está conectado, coleta PIDs conforme prioridade/tempo
            uint32_t now = millis();

            if (now - lastFast >= 30) {
                lastFast = now;
                collectFast(systemStatus);
            }
            if (now - lastMed >= 600) {
                lastMed = now;
                collectMedium(systemStatus);
            }
            if (now - lastSlow >= 1000) {
                lastSlow = now;
                collectSlow(systemStatus);
            }
            if (now - lastLog >= 1000) {
                lastLog = now;
                debugDump(systemStatus); // Log para debug
            }
        }
        else
        {
            // Se não está conectado: zera valores e informa tempo para próxima tentativa
            resetValuePIDs(systemStatus);

            // Log do tempo até próxima reconexão (apenas 1x por segundo)
            static uint32_t lastDebugReconnect = 0;
            uint32_t now = millis();

            if (now - lastDebugReconnect >= 1000) {
                lastDebugReconnect = now;
                uint32_t ttnr = OBD2.timeToNextReconnect();
                CAN_TASK_DEBUG_PRINTF("Sem conexão. Próxima tentativa em %lu ms\n", (unsigned long)ttnr);
            }
        }

        // Evita travar a CPU: pequena pausa de 10 ms entre loops
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}
